
//==============================================================================//
//	Z80 Single Board Computer "PC-84C0SD 20MHz" I/O Sketch for ESP32-S3-MINI-1	//
//				Implemented by Shisuibi ～Grand Master Sorcerian～				//
//==============================================================================//


//==============================================================================//
#ifdef		UpperDefinition
//==============================================================================//


//==============================================================================//
#define		MatrixStackMax				16				//	行列演算スタック上限
//==============================================================================//


//==============================================================================//
#endif
//------------------------------------------------------------------------------//
#ifdef		LowerDefinition
//==============================================================================//


//==============================================================================//
static Sint08 iCurrMatrix;								//	現行行列演算
//------------------------------------------------------------------------------//
static Sflt32 afMatrixStack[MatrixStackMax][XYZW][XYZW];	//	行列演算スタック
//==============================================================================//


//==============================================================================//
static void MatrixPush(void) {
	Sint08 i, j;
	Sflt32 (* pDst)[XYZW], (* pSrc)[XYZW] = afMatrixStack[iCurrMatrix];

	if(iCurrMatrix < (MatrixStackMax - 1))	pDst = afMatrixStack[++iCurrMatrix];
	else									return;

	for(i = 0;i < XYZW;i++) {
		for(j = 0;j < XYZW;j++) {
			pDst[i][j] = pSrc[i][j];
		}
	}
}
//------------------------------------------------------------------------------//
static void MatrixPop(void) {
	if(iCurrMatrix > 0) iCurrMatrix--;
}
//------------------------------------------------------------------------------//
static void MatrixUnit(void) {
	Sint08 i, j;
	Sflt32 (* pMat)[XYZW] = afMatrixStack[iCurrMatrix];

	for(i = 0;i < XYZW;i++) {
		for(j = 0;j < XYZW;j++) {
			if(i == j)	pMat[i][j] = 1.0;
			else		pMat[i][j] = 0.0;
		}
	}
}
//------------------------------------------------------------------------------//
static void MatrixPers(Sflt32 fAng, Sflt32 fNea, Sflt32 fFar) {
	Sflt32 fPer = 1.0 / tan(PI * (fAng / 360.0));
	Sflt32 fDis = fFar - fNea;
	Sflt32 (* pMat)[XYZW] = afMatrixStack[iCurrMatrix];

	pMat[X][X] = fPer;	pMat[X][Y] = 0.0;	pMat[X][Z] = 0.0;							pMat[X][W] = 0.0;
	pMat[Y][X] = 0.0;	pMat[Y][Y] = fPer;	pMat[Y][Z] = 0.0;							pMat[Y][W] = 0.0;
	pMat[Z][X] = 0.0;	pMat[Z][Y] = 0.0;	pMat[Z][Z] = (fFar + fNea) / fDis;			pMat[Z][W] = 1.0;
	pMat[W][X] = 0.0;	pMat[W][Y] = 0.0;	pMat[W][Z] = -(2.0 * fFar * fNea) / fDis;	pMat[W][W] = 0.0;
}
//==============================================================================//


//==============================================================================//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
static Sflt32 afModelVertex[4][XYZW] = {
	{	-1.0,	-1.0,	1.0,	1.0,	},
	{	 1.0,	-1.0,	1.0,	1.0,	},
	{	-1.0,	 1.0,	1.0,	1.0,	},
	{	 1.0,	 1.0,	1.0,	1.0,	},
};
//------------------------------------------------------------------------------//
static Sflt32 afCalcVertex[2][XYZW];
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//==============================================================================//


//==============================================================================//
static void MatrixPrint(void) {
	Sint08 i, j;
	Sflt32 (* pMat)[XYZW] = afMatrixStack[iCurrMatrix];

	for(i = 0;i < XYZW;i++) {
		for(j = 0;j < XYZW;j++) {
			Serial.printf("%f | ", pMat[i][j]);
		}

		Serial.println();
	}

	Serial.println();
}
//------------------------------------------------------------------------------//
static void VertexPrint(void) {
	Sint08 i, j;

	for(i = 0;i < 2;i++) {
		for(j = 0;j < XYZW;j++) {
			Serial.printf("%f | ", afCalcVertex[i][j]);
		}

		Serial.println();
	}

	Serial.println();
}
//------------------------------------------------------------------------------//
static void MatrixCalc(void) {
	Sint08 i, j;
	Sflt32 (* pMat)[XYZW] = afMatrixStack[iCurrMatrix];

	for(i = 0;i < XYZW;i++) {
		afCalcVertex[1][i] = 0.0;

		for(j = 0;j < XYZW;j++) {
			afCalcVertex[1][i] += pMat[j][i] * afCalcVertex[0][j];
		}
	}
}
//------------------------------------------------------------------------------//
static void MatrixVertex(void) {
	Sint08 i, j;

	for(i = 0;i < 4;i++) {
		for(j = 0;j < XYZW;j++) {
			afCalcVertex[0][j] = afModelVertex[i][j];
		}

		MatrixCalc();
		VertexPrint();
	}
}
//==============================================================================//


//==============================================================================//
static void MatrixGraphic(void) {
	static Uint16 aiColor[4][6] = {
		{	TFT_BLACK,	TFT_NAVY,		TFT_DARKGREEN,	TFT_DARKCYAN,	TFT_MAROON,		TFT_PURPLE,			},
		{	TFT_OLIVE,	TFT_LIGHTGREY,	TFT_DARKGREY,	TFT_BLUE,		TFT_GREEN,		TFT_CYAN,			},
		{	TFT_RED,	TFT_MAGENTA,	TFT_YELLOW,		TFT_WHITE,		TFT_ORANGE,		TFT_GREENYELLOW,	},
		{	TFT_PINK,	TFT_BROWN,		TFT_GOLD,		TFT_SILVER,		TFT_SKYBLUE,	TFT_VIOLET,			},
	};
	Sint16 i, j;

	SpiLCD.startWrite();

	for(i = 0;i < 4;i++) {
		for(j = 0;j < 6;j++) {
			Canvas.writeFillRect(j * 60, i * 60, 60, 60, aiColor[i][j]);
		}
	}

	SpiLCD.endWrite();
}
//------------------------------------------------------------------------------//
static void MatrixFrameRate(void) {
	static Uint32 iCount = 0;
	static Uint32 iFrame = 0;
	static Uint32 iMatrixMicros = 0;
	Uint32 iMicros = micros();

	if(LcdModeSegment) return;

	iFrame += 1000000 / (iMicros - iMatrixMicros);
	iMatrixMicros = iMicros;

	if(++iCount >= 100) {
		Serial.printf("[FPS %02X]", iFrame / 100);
		iCount = iFrame = 0;
	}
}
//==============================================================================//


//==============================================================================//
static void MatrixInit(void) {
	if(Esp32Master) return;

	iCurrMatrix = 0;
	MatrixUnit();

//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
/*@@@@
	MatrixGraphic();
	MatrixPers(90.0, 1.0, 100.0);
	MatrixPrint();
	MatrixVertex();
@@@@*/
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
}
//------------------------------------------------------------------------------//
static void MatrixMove(void) {
	if(Esp32Master) return;

//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
/*@@@@
	MatrixFrameRate();
@@@@*/
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@//
}
//==============================================================================//


//==============================================================================//
#endif
//==============================================================================//

