
//==============================================================================//
//		Z80 Single Board Computer "PC-84C0xx 20MHz" HEX to ROM Converter		//
//				Implemented by Shisuibi --Grand Master Sorcerian--				//
//==============================================================================//


//==============================================================================//
enum {
	X, Y, Z, XY = Z, XYZ,								//	マトリクス参照
};
//------------------------------------------------------------------------------//
#define		False						0				//	論理値（偽）
#define		True						(-1)			//	論理値（真）
//------------------------------------------------------------------------------//
#define		StringSizeS					0x0010			//	文字列幅（短）
#define		StringSizeL					0x0100			//	文字列幅（長）
//------------------------------------------------------------------------------//
typedef		unsigned char				Uint08;			//	符号無し整数（08bit）
typedef		signed char					Sint08;			//	符号有り整数（08bit）

typedef		unsigned short				Uint16;			//	符号無し整数（16bit）
typedef		signed short				Sint16;			//	符号有り整数（16bit）

typedef		unsigned long				Uint32;			//	符号無し整数（32bit）
typedef		signed long					Sint32;			//	符号有り整数（32bit）
//------------------------------------------------------------------------------//
typedef		signed long					Sfix08;			//	固定小数点数（08bit）
typedef		signed long					Sfix16;			//	固定小数点数（16bit）
typedef		signed long					Sfix24;			//	固定小数点数（24bit）
//------------------------------------------------------------------------------//
typedef		float						Sflt32;			//	浮動小数点数（32bit）
typedef		double						Sflt64;			//	浮動小数点数（64bit）
//==============================================================================//


//==============================================================================//
#include	<stdio.h>
//------------------------------------------------------------------------------//
#define		RecSize					(StringSizeL * 4)	//	HEXレコードサイズ
#define		RomSize						0x10000			//	ROMデータサイズ
//------------------------------------------------------------------------------//
#define		RecTypeData					0x00			//	レコードタイプ（Data）
#define		RecTypeEOF					0x01			//	レコードタイプ（EOF）
//------------------------------------------------------------------------------//
#define		RomDataFix					0xFF			//	ROMデータ初期値
//==============================================================================//

